Tekla Open API Reference for Tekla Structures 2025
ShapeItem.GetMetadata Method
 Get the Shape item's metadata.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetMetadata(
	string key,
	ref ShapeMetadataTypeEnum type,
	ref Object value,
	ref string label,
	ref string description
)
Public Function GetMetadata (
	key As String,
	ByRef type As ShapeMetadataTypeEnum,
	ByRef value As Object,
	ByRef label As String,
	ByRef description As String
) As Boolean
Parameters
key
Type: System.String
The key of metadata.
type
Type: Tekla.Structures.Catalogs.ShapeMetadataTypeEnum
The type of metadata.
value
Type: System.Object
The value of metadata.
label
Type: System.String
The label of metadata.
description
Type: System.String
The description of metadata.
Return Value
Type: Boolean
True if success or False
Examples
public void SetMetadataTest()
{
    var polymesh = CreateSomeValidBrep();
    var shapeItem = new ShapeItem
    {
        Name = "TestFileName",
        ShapeFacetedBrep = polymesh,
        UpAxis = ShapeUpAxis.Z_Axis
    };
    shapeItem.Insert();
    shapeItem.SetMetadata("test", ShapeMetadataTypeEnum.Text, "testvalue", "teststring", "");
    object value = null;
    ShapeMetadataTypeEnum type = ShapeMetadataTypeEnum.Text;
    string label = string.Empty;
    string desc = string.Empty;
    shapeItem.GetMetadata("test", ref type, ref value, ref label, ref desc);
}
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace